bar_result.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking bar.localhost (be patient)


Server Software:        
Server Hostname:        bar.localhost
Server Port:            80

Document Path:          /
Document Length:        15 bytes

Concurrency Level:      10
Time taken for tests:   0.160 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      196000 bytes
HTML transferred:       15000 bytes
Requests per second:    6234.30 [#/sec] (mean)
Time per request:       1.604 [ms] (mean)
Time per request:       0.160 [ms] (mean, across all concurrent requests)
Transfer rate:          1193.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     1    1   0.9      1      11
Waiting:        0    1   0.9      1      10
Total:          1    2   0.9      1      11
WARNING: The median and mean for the total time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      2
  95%      2
  98%      3
  99%      8
 100%     11 (longest request)